[
  {
    "companyPosition": "Machine Learning Engineer - DataAnnotation.tech",
    "dateRange": "Feb 2023 - Current",
    "description": "Employed at DataAnnotation.tech, training AI models to tackle complex data science challenges. Utilizes model selection techniques to optimize performance. Continuously updates knowledge and skills to improve model training methods. Successfully trained multiple AI models, optimized performance through advanced selection techniques, contributed to an efficient AI training pipeline, and collaborated on data annotation and labeling for AI model training."
  },
  {
    "companyPosition": "Network Engineer Intern - Starnet Systems",
    "dateRange": "May 2023 - Aug 2023",
    "description": "Designed and implemented robust network infrastructures, ensured network security, and optimized performance while collaborating with the IT team at Starnet Systems. Skilled in diagnosing and resolving network issues, minimizing downtime and enhancing system reliability. Maintained comprehensive network configuration records, design alterations, and troubleshooting steps. Implemented security measures to protect network integrity and prevent unauthorized access. Regularly monitored network performance and made adjustments for optimal speed and efficiency. Worked closely with IT team members to understand network needs and provide solutions."
  },
  {
    "companyPosition": "IT Intern - Huduma Kenya",
    "dateRange": "Jun 2022 - Aug 2022",
    "description": "Collaborated to streamline ICT services at Huduma Kenya, managed networks and servers, set up and managed virtual workstations, and improved service delivery, resulting in a 43.75% increase in daily customers served. Collaborated with peers to streamline ICT services (increased daily customer service from 160 to 230, a 43.75% improvement). Managed networks and servers for optimal performance and reliability. Designed, set up, and managed virtual workstations for enhanced efficiency in remote work environments. Expedited service delivery through effective management of the service-by-appointment system, reducing wait times and improving customer satisfaction."
  },
  {
    "companyPosition": "Web Developer - McGregory Consultancy",
    "dateRange": "Dec 2021 - Apr 2022",
    "description": "Led the design and implementation of the official company website at McGregory Consultancy, resulting in increased engagement and new customer acquisition. Conducted a comprehensive case study for website improvement and optimization. Regularly performed website troubleshooting to ensure optimal performance and user experience. Continuously improved the website's user interface and user experience, leading to higher user satisfaction and engagement."
  }
]
